"""
Написать программу, которая проверяет является ли число палиндромом. Палиндром - строка или число, которая читается
одинаково, как слева направо, так и наоборот.

Например: число 77
"""


def replacee(s: str) -> str:
    r = {',': '', '?': '', ' ': '', '~': '', '!': '', '@': '', '#': '',
         '$': '', '%': '', '^': '', '&': '', '*': '', '(': '', ')': '', '-': '', '=': '', '+': '',
         ':': '', ';': '', '<': '', '>': '', '\'': '', '"': '', '\\': '', '/': '', '№': '',
         '[': '', ']': '', '{': '', '}': '', 'ґ': '', 'ї': '', 'є': '', 'Ґ': 'g', 'Ї': 'i',
         'Є': 'e', '—': ''}
    for key in r:
        s = s.replace(key, r[key])
    return s


tmp = replacee(input().strip().lower())
print('Палиндром' if tmp == tmp[::-1] else 'Не палиндром')
